Netology/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки()
		
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПересчетСтроки(ТекущиеДанныеТаблицы);

		
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтроки(СтрокаТаблицы)
	КоэффициентСкидки = (1-(Объект.Скидка/100));
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество*СтрокаТаблицы.Цена*КоэффициентСкидки;

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	СортироватьПоВозрастанию = Не СортироватьПоВозрастанию;
	Если СортироватьПоВозрастанию = Истина Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		Элементы.ФормаСортироватьПоСумме.Заголовок = "Сортировать по возрастанию";
		Элементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
		Элементы.ФормаСортироватьПоСумме.Заголовок = "Сортировать по убыванию";
		Элементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСоСкидкой(Команда)
	Для Каждого Строка Из Объект.Товары Цикл
		 ПересчетСтроки(Строка);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы.Цена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанныеТаблицы.Количество = ТекущиеДанныеТаблицы.Сумма/ТекущиеДанныеТаблицы.Цена;
  КонецПроцедуры
  
  
&НаКлиенте
		Процедура Далее(Команда)
			Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.Основное Тогда
				 Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары;
			 КонецЕсли;
			 ДоступностьКоманд();
		КонецПроцедуры

		&НаКлиенте
		Процедура Назад(Команда)
			Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
				Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.Основное;
			КонецЕсли;
		ДоступностьКоманд();
	
		КонецПроцедуры 
		
		&НаКлиенте
		Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
			ДоступностьКоманд();

		КонецПроцедуры
		
		&НаКлиенте
		Процедура ДоступностьКоманд()
			
			Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
				Элементы.ФормаНазад.Доступность=Истина;
				Элементы.ФормаДалее.Доступность=Ложь;
			ИначеЕсли Элементы.СтраницыФормы.ТекущаяСтраница=Элементы.Основное Тогда
				Элементы.ФормаНазад.Доступность=Ложь;
				Элементы.ФормаДалее.Доступность = Истина;
			КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		
	КонецЦикла;
КонецПроцедуры
